// Find min


// ให้สร้างฟังก์ชันชื่อ findMin มีพารามิเตอร์ 2 ตัว
// ให้ผลลัพธ์เป็นค่าที่น้อยกว่าของพารามิเตอร์ทั้งสอง

//---------------------------------------------------

// function findMin (a,b){ //ให้สร้างฟังก์ชันชื่อ findMin มีพารามิเตอร์ 2 ตัว ####
//         let sum = 0;

//     sum = Math.min(a,b)-1 ;

//     console.log(Math.min(a, b));
//     console.log(sum);   // ให้ผลลัพธ์เป็นค่าที่น้อยกว่าของพารามิเตอร์ทั้งสอง ###
//     return 
    
// }

// findMin(5,10)















//--------------------------------------------------

// - ให้สร้างฟังก์ชัน max ซึ่งจะคืนค่าพารามิเตอร์ที่มีค่ามากที่สุด
// - พารามิเตอร์มีได้มากสุด 4 ตัว #
// - หากใน argument ของฟังก์ชันมีค่าที่ไม่ใช่ตัวเลข ให้คืนค่าเป็น NaN
// - เมื่อเรียกใช้งานฟังก์ชันต้องได้ผลลัพธ์ ดังนี้

// ```js
// max(); // undefined
// max(2); // 2
// max(3, 1); // 3
// max(7, 3, 9, 2); // 9
// ```

//ให้สร้างฟังก์ชัน max ซึ่งจะคืนค่าพารามิเตอร์ที่มีค่ามากที่สุด #
//พารามิเตอร์มีได้มากสุด 4 ตัว #
function max(a="",b="",c="",d=""){
    if(a===""){
        return a = undefined 
    }
 return  Math.max(a,b,c,d)  
    
}
console.log(max());
console.log(max(2));
console.log(max(3,1));
console.log(max(7,3,9,2));
